## [pandas](https://pandas.pydata.org/)

- pandas is a NumPy based data analysis tool. Many of its ideas were borrowed from the R language.
- pandas' fundamental data types are the **DataFrame** (table) and the **Series** (column).
- pandas can be viewed as an in-memory, column oriented database.

In [1]:
# Importing pandas as pd.
import pandas as pd

In [2]:
# The version number of pandas.
pd.__version__

'1.5.3'

### DataFrame

In [3]:
# Creating a DataFrame from columns.
# The input is a dict, where the keys are the column names and the values are the columns.
data = {
    'a': [10, 20, 30, 40],
    'b': ['xx', 'yy', 'zz', 'qq'],
    'c': [1.5, 2.6, 3.7, 4.8]
}
df1 = pd.DataFrame(data)
df1

    a   b    c
0  10  xx  1.5
1  20  yy  2.6
2  30  zz  3.7
3  40  qq  4.8

In [4]:
# The type of df1.
type(df1)

pandas.core.frame.DataFrame

In [5]:
# Column names.
df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [6]:
df1.columns[0]

'a'

In [7]:
# Iterating over column names.
for col in df1:
    print(col)

a
b
c

In [8]:
# Number of rows.
len(df1)

4

In [9]:
# Shape of the DataFrame.
df1.shape

(4, 3)

In [10]:
# Summary information.
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      int64
 1   b       4 non-null      object
 2   c       4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [11]:
# Basic statistics about the numerical columns.
df1.describe().T

   count   mean        std   min     25%    50%     75%   max
a    4.0  25.00  12.909944  10.0  17.500  25.00  32.500  40.0
c    4.0   3.15   1.420094   1.5   2.325   3.15   3.975   4.8

In [12]:
# Creating a DataFrame from rows.
# The input is a list of dicts, where each dict represents a row.
data = [
    {'a': 10, 'b': 'Joe', 'c': 1.5},
    {'a': 20, 'c': 1.5},
    {'a': 30, 'b': 'Tom', 'c': 2.5},
    {'a': 40, 'b': 'George', 'c': 5.5}
]
df2 = pd.DataFrame(data)
df2

    a       b    c
0  10     Joe  1.5
1  20     NaN  1.5
2  30     Tom  2.5
3  40  George  5.5

In [13]:
# An interesting property of NaN.
import numpy as np
np.nan == np.nan

False

In [14]:
# Every DataFrame (and Series) contains an index.
# By default, the index starts from 0 and increases by 1.
df1

    a   b    c
0  10  xx  1.5
1  20  yy  2.6
2  30  zz  3.7
3  40  qq  4.8

In [15]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
# This can be overridden of course.
data = {
    'a': [10, 20, 30, 40],
    'b': ['xx', 'yy', 'zz', 'qq'],
    'c': [1.5, 2.6, 3.7, 4.8]
}
df3 = pd.DataFrame(data, index=['aa', 'bb', 'cc', 'dd'])
df3

     a   b    c
aa  10  xx  1.5
bb  20  yy  2.6
cc  30  zz  3.7
dd  40  qq  4.8

In [17]:
# Using an existing column as an index.
df4 = df3.set_index('b')
df4

     a    c
b
xx  10  1.5
yy  20  2.6
zz  30  3.7
qq  40  4.8

### Series

In [18]:
# Creating a Series (using the default index).
se1 = pd.Series([20, 30, 40])
se1

0    20
1    30
2    40
dtype: int64

In [19]:
# The type of se1.
type(se1)

pandas.core.series.Series

In [20]:
# Creating a Series with an index.
se2 = pd.Series([20, 30, 40], index=['foo', 'bar', 'banana'])
se2

foo       20
bar       30
banana    40
dtype: int64

### Indexing

In [21]:
# A column can be selected from a DataFrame using the [] operator.
df1['a']

0    10
1    20
2    30
3    40
Name: a, dtype: int64

In [22]:
# ...or if the column name is a valid identifier, then the . operator can be used too.
df1.a

0    10
1    20
2    30
3    40
Name: a, dtype: int64

In [23]:
# Selecting multiple columns.
df1[['a', 'c']]

    a    c
0  10  1.5
1  20  2.6
2  30  3.7
3  40  4.8

In [24]:
# If we index by a list of size 1, then the type of the result is DataFrame.
df1[['a']]

    a
0  10
1  20
2  30
3  40

In [25]:
# Selecting a single row from a DataFrame.
df3.loc['bb']

a     20
b     yy
c    2.6
Name: bb, dtype: object

In [26]:
# Selecting multiple rows from a DataFrame.
df3.loc[['bb', 'dd']]

     a   b    c
bb  20  yy  2.6
dd  40  qq  4.8

In [27]:
# Position based selection of rows.
df3.iloc[0]

a     10
b     xx
c    1.5
Name: aa, dtype: object

In [28]:
# Selecting an item from a Series.
se2['banana']

40

In [29]:
se2[['foo', 'bar']]

foo    20
bar    30
dtype: int64

In [30]:
# Accessing the data in raw format as a NumPy array.
se2.values

array([20, 30, 40])

In [31]:
df1.values

array([[10, 'xx', 1.5],
       [20, 'yy', 2.6],
       [30, 'zz', 3.7],
       [40, 'qq', 4.8]], dtype=object)

### Simple Queries

In [32]:
# Let's create an example DataFrame!
df = pd.DataFrame([
    {'student': 'John Doe', 'subject': 'Mathematics',  'grade': 5},
    {'student': 'John Doe', 'subject': 'History', 'grade': 2},
    {'student': 'Jane Smith', 'subject': 'Mathematics',  'grade': 3},
    {'student': 'Jane Smith', 'subject': 'Mathematics',  'grade': 5},
    {'student': 'Jane Smith', 'subject': 'History', 'grade': 4},
    {'student': 'Scunner Campbell', 'subject': 'Mathematics',  'grade': 1},
    {'student': 'Scunner Campbell', 'subject': 'Mathematics',  'grade': 2},
    {'student': 'Scunner Campbell', 'subject': 'History', 'grade': 5},
])
df

            student      subject  grade
0          John Doe  Mathematics      5
1          John Doe      History      2
2        Jane Smith  Mathematics      3
3        Jane Smith  Mathematics      5
4        Jane Smith      History      4
5  Scunner Campbell  Mathematics      1
6  Scunner Campbell  Mathematics      2
7  Scunner Campbell      History      5

In [33]:
# Average of the grade column.
df['grade'].mean()

3.375

In [34]:
# Logical condition column.
df['student'] == 'John Doe'

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: student, dtype: bool

In [35]:
# All grades of John Doe.
df[df['student'] == 'John Doe']

    student      subject  grade
0  John Doe  Mathematics      5
1  John Doe      History      2

In [36]:
# Grades better than 1 and worse than 5.
df[(df['grade'] > 1) & (df['grade'] < 5)]

            student      subject  grade
1          John Doe      History      2
2        Jane Smith  Mathematics      3
4        Jane Smith      History      4
6  Scunner Campbell  Mathematics      2

### GroupBy Queries

In pandas, the steps of grouping are as follows:

- **Splitting** the data into groups based on some criteria.
- **Applying** a function to each group independently.
- **Combining** the results into a data structure.

Out of these, the split step is the most straightforward. The splitting criterion is usually a column or a set of columns. The apply step is typically an aggregation (e.g. number of items in the group, number of unique values, sum, mean, minimum, maximum, first record, last record). If the apply step is an aggregation, then combining runs automatically, otherwise the programmer has to initiate it.

In [37]:
# Let's display the "grades" DataFrame!
df

            student      subject  grade
0          John Doe  Mathematics      5
1          John Doe      History      2
2        Jane Smith  Mathematics      3
3        Jane Smith  Mathematics      5
4        Jane Smith      History      4
5  Scunner Campbell  Mathematics      1
6  Scunner Campbell  Mathematics      2
7  Scunner Campbell      History      5

In [38]:
# Group by subject.
gb = df.groupby('subject')

In [39]:
# The type of the result.
type(gb)

pandas.core.groupby.generic.DataFrameGroupBy

In [40]:
# Number of records per subject.
gb.size()

subject
History        3
Mathematics    5
dtype: int64

In [41]:
# The same query, without using an auxiliary variable.
df.groupby('subject').size()

subject
History        3
Mathematics    5
dtype: int64

In [42]:
# Average grade per subject.
df.groupby('subject')['grade'].mean()

subject
History        3.666667
Mathematics    3.200000
Name: grade, dtype: float64

In [43]:
# Subject with the highest average grade.
df.groupby('subject')['grade'].mean().idxmax()

'History'

In [44]:
# Subject averages for every student.
df.groupby(['student', 'subject']).mean()

                              grade
student          subject
Jane Smith       History        4.0
                 Mathematics    4.0
John Doe         History        2.0
                 Mathematics    5.0
Scunner Campbell History        5.0
                 Mathematics    1.5

In [45]:
# Transforming the index to 2 ordinary columns.
df.groupby(['student', 'subject']).mean().reset_index()

            student      subject  grade
0        Jane Smith      History    4.0
1        Jane Smith  Mathematics    4.0
2          John Doe      History    2.0
3          John Doe  Mathematics    5.0
4  Scunner Campbell      History    5.0
5  Scunner Campbell  Mathematics    1.5

### Example Queries on the [pl.txt](pl.txt) Data Set

In [46]:
# Loading pl.txt into a DataFrame.
names = ['round', 'hteam', 'ateam', 'hgoals', 'agoals']
df = pd.read_csv('pl.txt', sep='\t', comment='#', names=names)
df

     round                 hteam                    ateam  hgoals  agoals
0        1      Blackburn Rovers  Wolverhampton Wanderers       1       2
1        1             Fulham FC              Aston Villa       0       0
2        1          Liverpool FC           Sunderland AFC       1       1
3        1   Queens Park Rangers         Bolton Wanderers       0       4
4        1        Wigan Athletic             Norwich City       1       1
..     ...                   ...                      ...     ...     ...
375     38        Sunderland AFC        Manchester United       0       1
376     38          Swansea City             Liverpool FC       1       0
377     38     Tottenham Hotspur                Fulham FC       2       0
378     38  West Bromwich Albion               Arsenal FC       2       3
379     38        Wigan Athletic  Wolverhampton Wanderers       3       2

[380 rows x 5 columns]

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 380 entries, 0 to 379
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   round   380 non-null    int64
 1   hteam   380 non-null    object
 2   ateam   380 non-null    object
 3   hgoals  380 non-null    int64
 4   agoals  380 non-null    int64
dtypes: int64(3), object(2)
memory usage: 15.0+ KB

In [48]:
df.describe().T

        count       mean        std  min   25%   50%   75%   max
round   380.0  19.500000  10.980313  1.0  10.0  19.5  29.0  38.0
hgoals  380.0   1.589474   1.331531  0.0   1.0   1.0   2.0   8.0
agoals  380.0   1.215789   1.204987  0.0   0.0   1.0   2.0   6.0

In [49]:
# Add "number of goals" column to the DataFrame.
df['goals'] = df['hgoals'] + df['agoals']
df

,round,hteam,ateam,hgoals,agoals,goals
0,1,Blackburn Rovers,Wolverhampton Wanderers,1,2,3
1,1,Fulham FC,Aston Villa,0,0,0
2,1,Liverpool FC,Sunderland AFC,1,1,2
3,1,Queens Park Rangers,Bolton Wanderers,0,4,4
4,1,Wigan Athletic,Norwich City,1,1,2
...,...,...,...,...,...,...
375,38,Sunderland AFC,Manchester United,0,1,1
376,38,Swansea City,Liverpool FC,1,0,1
377,38,Tottenham Hotspur,Fulham FC,2,0,2
378,38,West Bromwich Albion,Arsenal FC,2,3,5
379,38,Wigan Athletic,Wolverhampton Wanderers,3,2,5

In [50]:
# Total number of goals scored in round 13.
df[df['round'] == 13]['goals'].sum()

25

In [51]:
# Which round had the highest number of goals?
df.groupby('round')['goals'].sum().idxmax()

10

In [52]:
df

,round,hteam,ateam,hgoals,agoals,goals
0,1,Blackburn Rovers,Wolverhampton Wanderers,1,2,3
1,1,Fulham FC,Aston Villa,0,0,0
2,1,Liverpool FC,Sunderland AFC,1,1,2
3,1,Queens Park Rangers,Bolton Wanderers,0,4,4
4,1,Wigan Athletic,Norwich City,1,1,2
...,...,...,...,...,...,...
375,38,Sunderland AFC,Manchester United,0,1,1
376,38,Swansea City,Liverpool FC,1,0,1
377,38,Tottenham Hotspur,Fulham FC,2,0,2
378,38,West Bromwich Albion,Arsenal FC,2,3,5
379,38,Wigan Athletic,Wolverhampton Wanderers,3,2,5

In [53]:
# Number of games per round.
df.groupby('round').size()

round
1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    10
11    10
12    10
13    10
14    10
15    10
16    10
17    10
18    10
19    10
20    10
21    10
22    10
23    10
24    10
25    10
26    10
27    10
28    10
29    10
30    10
31    10
32    10
33    10
34    10
35    10
36    10
37    10
38    10
dtype: int64

In [54]:
# Print the 10 rounds with the highest number of goals!
df.groupby('round')['goals'].sum().sort_values()[::-1][:10]

round
10    39
5     38
25    36
36    35
22    35
31    35
7     34
38    32
8     32
24    31
Name: goals, dtype: int64

In [55]:
# What percentage of the games had at least 1 goal?
(df['goals'] > 0).mean() * 100

92.89473684210526

In [56]:
# What was the game with the highest number of goals?
df.loc[df['goals'].idxmax()]

round                     3
hteam     Manchester United
ateam            Arsenal FC
hgoals                    8
agoals                    2
goals                    10
Name: 29, dtype: object

In [57]:
# Total number of goals scored by Manchester United?
gh = df[df['hteam'] == 'Manchester United']['hgoals'].sum()
ga = df[df['ateam'] == 'Manchester United']['agoals'].sum()
gh + ga

89

In [58]:
# Top 5 teams, scoring the most goals.
res = df.groupby('hteam')['hgoals'].sum() + df.groupby('ateam')['agoals'].sum()
res = res.sort_values(ascending=False)[:5]
res.index.name = 'team'
res

team
Manchester City      93
Manchester United    89
Arsenal FC           74
Tottenham Hotspur    66
Chelsea FC           65
dtype: int64

### Example Queries on the EAFC'24 Data Set

[eafc24.txt](../_data/eafc24.txt) contains data about male players in the video game EAFC'24.

In [59]:
# Load the data into a DataFrame!
df = pd.read_csv('../_data/eafc24.txt')

/tmp/ipykernel_11471/1733170057.py:2: DtypeWarning: Columns (29) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('../_data/eafc24.txt')

In [60]:
df.head()

,player_id,player_url,fifa_version,fifa_update,update_as_of,short_name,long_name,player_positions,overall,potential,...,ldm,cdm,rdm,rwb,lb,lcb,cb,rcb,rb,gk
0,231747,/player/231747/kylian-mbappe/240002,24.0,2.0,2023-09-22,K. Mbapp,Kylian Mbapp Lottin,"ST, LW",91,94,...,63+3,63+3,63+3,68+3,63+3,54+3,54+3,54+3,63+3,18+3
1,239085,/player/239085/erling-haaland/240002,24.0,2.0,2023-09-22,E. Haaland,Erling Braut Haaland,ST,91,94,...,63+3,63+3,63+3,62+3,60+3,62+3,62+3,62+3,60+3,19+3
2,192985,/player/192985/kevin-de-bruyne/240002,24.0,2.0,2023-09-22,K. De Bruyne,Kevin De Bruyne,"CM, CAM",91,91,...,80+3,80+3,80+3,79+3,75+3,70+3,70+3,70+3,75+3,21+3
3,158023,/player/158023/lionel-messi/240002,24.0,2.0,2023-09-22,L. Messi,Lionel Andrs Messi Cuccittini,"CF, CAM",90,90,...,63+3,63+3,63+3,64+3,59+3,49+3,49+3,49+3,59+3,19+3
4,165153,/player/165153/karim-benzema/240002,24.0,2.0,2023-09-22,K. Benzema,Karim Benzema,"CF, ST",90,90,...,64+3,64+3,64+3,64+3,60+3,55+3,55+3,55+3,60+3,18+3

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18350 entries, 0 to 18349
Columns: 109 entries, player_id to gk
dtypes: float64(20), int64(43), object(46)
memory usage: 15.3+ MB

In [62]:
df.describe()

,player_id,fifa_version,fifa_update,overall,potential,value_eur,wage_eur,age,height_cm,weight_kg,...,mentality_composure,defending_marking_awareness,defending_standing_tackle,defending_sliding_tackle,goalkeeping_diving,goalkeeping_handling,goalkeeping_kicking,goalkeeping_positioning,goalkeeping_reflexes,goalkeeping_speed
count,18350.000000,18350.0,18350.0,18350.000000,18350.000000,1.825000e+04,18263.000000,18350.000000,18350.000000,18350.000000,...,18350.000000,18350.000000,18350.000000,18350.000000,18350.000000,18350.000000,18350.000000,18350.000000,18350.000000,2045.000000
mean,242440.726322,24.0,2.0,65.817057,71.088065,2.837585e+06,8723.388819,25.267139,181.698747,75.210354,...,57.976240,46.666975,48.532534,46.336240,16.329373,16.124578,16.035095,16.168392,16.423815,35.253790
std,26741.238580,0.0,0.0,6.817917,6.220982,7.562794e+06,18707.237605,4.757756,6.869995,6.985703,...,12.137094,20.415339,21.046124,20.569969,17.572154,16.945031,16.699136,17.093683,17.880726,10.591029
min,18115.000000,24.0,2.0,47.000000,48.000000,1.000000e+04,500.000000,16.000000,156.000000,49.000000,...,13.000000,3.000000,8.000000,6.000000,2.000000,2.000000,2.000000,2.000000,2.000000,15.000000
25%,225442.000000,24.0,2.0,62.000000,67.000000,4.750000e+05,1000.000000,21.000000,177.000000,70.000000,...,51.000000,29.000000,29.000000,26.000000,8.000000,8.000000,8.000000,8.000000,8.000000,26.000000
50%,245467.500000,24.0,2.0,66.000000,71.000000,1.000000e+06,3000.000000,25.000000,182.000000,75.000000,...,59.000000,52.000000,56.000000,53.000000,11.000000,11.000000,11.000000,11.000000,11.000000,34.000000
75%,264169.500000,24.0,2.0,70.000000,75.000000,2.000000e+06,8000.000000,29.000000,187.000000,80.000000,...,66.000000,63.000000,65.000000,63.000000,14.000000,14.000000,14.000000,14.000000,14.000000,44.000000
max,278145.000000,24.0,2.0,91.000000,94.000000,1.850000e+08,350000.000000,43.000000,206.000000,105.000000,...,96.000000,91.000000,91.000000,90.000000,90.000000,90.000000,91.000000,90.000000,93.000000,65.000000

In [63]:
df.shape

(18350, 109)

In [64]:
# How many teams (clubs) are in the data set?
df['club_name'].nunique()

670

In [65]:
# Which nationality is the most frequent one?
df.groupby('nationality_name').size().idxmax()

'England'

In [66]:
# ...alternative solution:
df['nationality_name'].value_counts()[:1]

England    1615
Name: nationality_name, dtype: int64

In [67]:
# What is the average player age?
df['age'].mean()

25.267138964577658

In [68]:
# Who is the oldest player?
columns = ['short_name', 'age', 'nationality_name', 'club_name']
df.loc[df['age'].idxmax()][columns]

short_name                        S. Luki
age                                     43
nationality_name    Bosnia and Herzegovina
club_name                     Varberg BoIS
Name: 14451, dtype: object

In [69]:
# ...alternative solution that is able to give multiple results:
columns = ['short_name', 'age', 'nationality_name', 'club_name']
df[df['age'] == df['age'].max()][columns]

      short_name  age        nationality_name     club_name
14451   S. Luki   43  Bosnia and Herzegovina  Varberg BoIS

In [70]:
# Who are the 10 fastest players (based on the "movement_sprint_speed" attribute)?
sp = 'movement_sprint_speed'
df.sort_values(sp, ascending=False)[:10][columns + [sp]]

,short_name,age,nationality_name,club_name,movement_sprint_speed
0,K. Mbapp,24,France,Paris Saint Germain,97
366,K. Adeyemi,21,Germany,Borussia Dortmund,96
918,J. St. Juste,26,Netherlands,Sporting CP,96
94,M. Diaby,23,France,Aston Villa,95
145,A. Davies,22,Canada,FC Bayern Mnchen,95
812,S. Becker,28,Suriname,FC Union Berlin,95
8,Vini Jr.,22,Brazil,Real Madrid,95
6814,S. Conteh,26,Germany,Paderborn,95
2893,K. Schade,21,Germany,Brentford,94
11665,M. Ajani,29,Germany,Hallescher FC,94

In [71]:
# Which is the team with the highest number of nationalities among its players?
df.groupby('club_name')['nationality_name'].nunique().idxmax()

'Fulham'

In [72]:
# What is the number of players per nationality in Fulham?
df[df['club_name'] == 'Fulham'].value_counts('nationality_name')

nationality_name
England                5
Brazil                 4
Australia              2
Nigeria                2
United States          2
Scotland               2
Wales                  2
Germany                2
Mexico                 1
Netherlands            1
Jamaica                1
Belgium                1
Republic of Ireland    1
Senegal                1
Serbia                 1
Slovakia               1
Spain                  1
Switzerland            1
France                 1
Portugal               1
dtype: int64

In [73]:
# How many Hungarian players are there in the data set?
(df['nationality_name'] == 'Hungary').sum()

43

In [74]:
# Who are the top 5 Hungarian players (based on the "overall" attribute)?
ov = 'overall'
df[df['nationality_name'] == 'Hungary'].sort_values(ov, ascending=False)[:5][columns + [ov]]

         short_name  age nationality_name       club_name  overall
119      P. Gulcsi   33          Hungary      RB Leipzig       84
182        W. Orban   30          Hungary      RB Leipzig       83
211   D. Szoboszlai   22          Hungary       Liverpool       82
1164      A. Szalai   25          Hungary  TSG Hoffenheim       76
1231      R. Sallai   26          Hungary     SC Freiburg       76

In [75]:
# Which 10 teams spend the most on wages?
df.groupby('club_name')['wage_eur'].sum().sort_values(ascending=False)[:10]

club_name
Real Madrid            3852000.0
Manchester City        3611000.0
FC Barcelona           3106350.0
Manchester United      3106000.0
Liverpool              2796100.0
Arsenal                2557000.0
Newcastle United       2442000.0
Paris Saint Germain    2238650.0
Chelsea                2119000.0
Juventus               1986000.0
Name: wage_eur, dtype: float64

### Largest Palindrome Product (Problem 4)

<p>A palindromic number reads the same both ways. The largest palindrome made from the product of two $2$-digit numbers is $9009 = 91 \times 99$.</p>
<p>Find the largest palindrome made from the product of two $3$-digit numbers.</p>

In [76]:
# solution 1
cand = []
for i in range(100, 1000):
    for j in range(100, 1000):
        n = i * j
        if str(n) == str(n)[::-1]:
            cand.append((n, i, j))
max(cand)

(906609, 993, 913)

In [77]:
# solution 2
from itertools import product
max(i * j for i, j in product(*([range(100, 1000)] * 2)) if str(i * j) == str(i * j)[::-1])

906609